org/R-info.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-18 木 07:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Masayuki Suzuki" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org35b36a8">1. R 一般</a></li>
<li><a href="#org9cc00ce">2. R と Rコマンダーのインストール方法</a></li>
<li><a href="#org7660989">3. R と Rコマンダーの使い方</a></li>
<li><a href="#org0d631f9">4. Rの設定など</a></li>
<li><a href="#org1682e9f">5. R言語 入門</a></li>
<li><a href="#org5f9099e">6. Rによる統計学講義</a>
<ul>
<li><a href="#org932c77a">6.1. 「Rによるやさしい統計学」</a>
<ul>
<li><a href="#org94b5815">6.1.1. Webpage for Probability Theory and Statistics (B)</a></li>
<li><a href="#org80f1416">6.1.2. 社会統計演習 (青山大学)</a></li>
</ul>
</li>
<li><a href="#orgb9cfb44">6.2. 生物統計学 (東大，農工大)</a></li>
<li><a href="#org50f7b95">6.3. 統計学&#x2013;2016&#x2013;富山大学経済学部&#x2013;唐渡広志</a></li>
<li><a href="#orgaec3cd2">6.4. Rによる統計入門 津田裕之氏</a></li>
</ul>
</li>
<li><a href="#orgf39fbc0">7. Rを使った統計学トピック的解説</a>
<ul>
<li><a href="#org98532b3">7.1. 医療職からデータサイエンティストへ blog</a></li>
</ul>
</li>
<li><a href="#orgea2fe20">8. マニュアル的な</a>
<ul>
<li>
<ul>
<li><a href="#org6a3df0a">8.0.1. Mase-Rstatman.pdf  基本パッケージ，カテゴリ別紹介，ヘルプドキュメント</a></li>
<li><a href="#orgf1ea181">8.0.2. CRAN: Manuals R</a></li>
<li><a href="#orgc7103b7">8.0.3. RjpWiki - RjpWiki</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgce4a2ad">9. graphics</a></li>
<li><a href="#orga1f5359">10. search</a>
<ul>
<li><a href="#orgffdd365">10.1. 積率母関数</a></li>
<li><a href="#org76152e1">10.2. 確率収束 例</a></li>
<li><a href="#orgbaa76f3">10.3. <span class="todo Doing">Doing</span> 標準偏差と標準誤差はどこが違うのか</a></li>
<li><a href="#org40d98ef">10.4. 平均</a></li>
<li><a href="#org00f6eaf">10.5. 統計学の時間 | 統計WEB</a></li>
<li><a href="#orgc8c8bc7">10.6. 信頼区間</a></li>
<li><a href="#org847a68c">10.7. excel シートを別々のCSV</a></li>
<li><a href="#org3b82dc3">10.8. R 移動平均 荷重平均</a></li>
<li><a href="#orgcb2f892">10.9. R と Excel 関数の対応</a></li>
<li><a href="#org13feb4e">10.10. R markdown</a></li>
<li><a href="#org55ab49d">10.11. R read.csv セパレータ</a></li>
<li><a href="#org5f99600">10.12. R ヒストグラム分析</a></li>
<li><a href="#org8555a20">10.13. RStudio 使い方</a>
<ul>
<li><a href="#org6a7414d">10.13.1. R/RStudio入門 CC-BY</a></li>
</ul>
</li>
<li><a href="#orgc9d4ea1">10.14. R グラフ 日本語</a></li>
<li><a href="#org3389d55">10.15. R plot type</a>
<ul>
<li><a href="#org7f726c0">10.15.1. R plot 重ね書き</a></li>
</ul>
</li>
<li><a href="#orgca6f898">10.16. R read.csv タブ 区切り</a></li>
<li><a href="#orgdfa4c72">10.17. R data.frame 行列 変換</a></li>
<li><a href="#org9dfbcd0">10.18. R 標準化 z</a></li>
<li><a href="#orgf54a52c">10.19. R 尖度 歪度</a></li>
<li><a href="#org5d69ab7">10.20. R 最尤推定</a>
<ul>
<li><a href="#org62a3a07">10.20.1. R optim, optimize</a></li>
<li><a href="#org652c4bc">10.20.2. R nlm</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org35b36a8" class="outline-2">
<h2 id="org35b36a8"><span class="section-number-2">1</span> R 一般</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://cse.naro.affrc.go.jp/takezawa/r-tips.pdf">R-Tips - r-tips.pdf</a></li>

<li><a href="http://www.f.waseda.jp/sakas/R/">道具箱：R</a></li>

<li><a href="https://ai-trend.jp/programming/">PROGRAMMING | AVILEN AI Trend</a> (python, R, &#x2026; )</li>

<li><a href="http://www.okadajp.org/RWiki/">RjpWiki - RjpWiki</a></li>

<li><a href="https://www.r-project.org/">R: The R Project for Statistical Computing</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9cc00ce" class="outline-2">
<h2 id="org9cc00ce"><span class="section-number-2">2</span> R と Rコマンダーのインストール方法</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://personal.hs.hirosaki-u.ac.jp/pteiki/research/yodosha/index.html">羊土社「統計解析実践ガイド」</a> 弘前大学</li>
</ul>
</div>
</div>

<div id="outline-container-org7660989" class="outline-2">
<h2 id="org7660989"><span class="section-number-2">3</span> R と Rコマンダーの使い方</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://oku.edu.mie-u.ac.jp/~okumura/stat/first.html">Rの初歩</a></li>
<li><a href="http://chianti.ucsd.edu/~rsaito/ENTRY1/WEB_RS3/PDF/JPN/Texts/R_Stats2.pdf">初心者用 - R<sub>Stats2.pdf</sub></a></li>
<li><a href="http://plaza.umin.ac.jp/~takeshou/R/Rcmdrfirst.html">Rコマンダーの簡単な使い方</a></li>
</ul>
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=MylCkVnA9jc&amp;list=PLi8B8P-sIpDhAHCW4s7FbkExNueHFOC3b">(24) はじめてのＲ 第1回はじめに （全10回） - YouTube</a></li>

<li><a href="https://www.youtube.com/watch?v=fXNKsXFMj7Y&amp;list=PLi8B8P-sIpDhir9u8RxTzVPhU43QtyNdW">(24) Ｒコマンダー 第1回 はじめに （全11回） - YouTube</a></li>

<li><a href="https://www.youtube.com/watch?v=9h_x7fV1vqI">(30) 統計解析ソフト「R」の使い方 〜Rの導入・パッケージの導入・作図・統計解析の基本編〜 - YouTube</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0d631f9" class="outline-2">
<h2 id="org0d631f9"><span class="section-number-2">4</span> Rの設定など</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://heavywatal.github.io/rstats/config.html">R環境設定 - Heavy Watal</a></li>
<li><a href="https://oku.edu.mie-u.ac.jp/~okumura/stat/first.html">Rの初歩</a></li>
<li><a href="https://repun-app.fish.hokudai.ac.jp/course/view.php?id=395#section-2">コース: 統計解析入門 &amp; 統計解析フリーソフトウェアRの使い方</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1682e9f" class="outline-2">
<h2 id="org1682e9f"><span class="section-number-2">5</span> R言語 入門</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>シンプル <a href="https://so-zou.jp/robot/tech/numerical-analysis/r/">R プログラミング解説</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5f9099e" class="outline-2">
<h2 id="org5f9099e"><span class="section-number-2">6</span> Rによる統計学講義</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org932c77a" class="outline-3">
<h3 id="org932c77a"><span class="section-number-3">6.1</span> 「Rによるやさしい統計学」</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org94b5815" class="outline-4">
<h4 id="org94b5815"><span class="section-number-4">6.1.1</span> <a href="http://whitewell.sakura.ne.jp/R/">Webpage for Probability Theory and Statistics (B)</a></h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
中京大 白井先生
</p>
</div>
</div>

<div id="outline-container-org80f1416" class="outline-4">
<h4 id="org80f1416"><span class="section-number-4">6.1.2</span> <a href="http://www.cc.aoyama.ac.jp/~t41338/lecture/aoyama/stat2e/stat2e_top.html">社会統計演習</a> (青山大学)</h4>
<div class="outline-text-4" id="text-6-1-2">
<ul class="org-ul">
<li>Rによるやさしい統計学の動画による解説</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb9cfb44" class="outline-3">
<h3 id="orgb9cfb44"><span class="section-number-3">6.2</span> 生物統計学 (東大，農工大)</h3>
<div class="outline-text-3" id="text-6-2">
<p>
R コードの参考に
</p>
</div>
<ol class="org-ol">
<li><a id="org40a41c6"></a><a href="http://lbm.ab.a.u-tokyo.ac.jp/~omori/noko/distribution.html">生物統計学１（10.9）</a><br />
<ol class="org-ol">
<li><a id="org859b143"></a><a href="http://lbm.ab.a.u-tokyo.ac.jp/~omori/noko/ex1.html">演習１（10.9）</a><br />
<div class="outline-text-6" id="text-6-2-0-1-1">
<p>
<a href="http://lbm.ab.a.u-tokyo.ac.jp/~omori/noko/ans1.html">解答１</a>
</p>
</div>
</li>
</ol>
</li>
<li><a id="org2b78453"></a><a href="http://lbm.ab.a.u-tokyo.ac.jp/~omori/noko/hytest.html">生物統計学２（10.23）</a><br />
<ol class="org-ol">
<li><a id="orgc4c8225"></a><a href="http://lbm.ab.a.u-tokyo.ac.jp/~omori/noko/ex2.html">演習２（10.23）</a><br /></li>
</ol>
</li>
<li><a id="org77a0fc3"></a><a href="http://lbm.ab.a.u-tokyo.ac.jp/~omori/noko/linearmodel.html">生物統計学３（10.30）</a><br />
<ol class="org-ol">
<li><a id="org43cb5d5"></a><a href="http://lbm.ab.a.u-tokyo.ac.jp/~omori/noko/ex3.html">演習３（10.30）</a><br /></li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-org50f7b95" class="outline-3">
<h3 id="org50f7b95"><span class="section-number-3">6.3</span> <a href="http://www3.u-toyama.ac.jp/kkarato/2016/statistics/">統計学&#x2013;2016&#x2013;富山大学経済学部&#x2013;唐渡広志</a></h3>
<div class="outline-text-3" id="text-6-3">
<p>
ppt よくできている
</p>
</div>
</div>

<div id="outline-container-orgaec3cd2" class="outline-3">
<h3 id="orgaec3cd2"><span class="section-number-3">6.4</span> <a href="https://htsuda.net/stats/">Rによる統計入門</a> 津田裕之氏</h3>
<div class="outline-text-3" id="text-6-4">
<ul class="org-ul">
<li>google colaboratory で R を使う</li>
<li>colabo note 例  <a href="https://colab.research.google.com/drive/1cPOGoBin8sQAJqJtnmS0H8mAqzyI9CzY">R<sub>tutorial.ipynb</sub> - Colaboratory</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf39fbc0" class="outline-2">
<h2 id="orgf39fbc0"><span class="section-number-2">7</span> Rを使った統計学トピック的解説</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org98532b3" class="outline-3">
<h3 id="org98532b3"><span class="section-number-3">7.1</span> 医療職からデータサイエンティストへ blog</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>わかりやすく簡単な説明</li>
<li>R のコード</li>

<li><a href="https://www.medi-08-data-06.work/archive/category/%E7%B5%B1%E8%A8%88%E5%AD%A6">統計学 カテゴリーの記事一覧 - 医療職からデータサイエンティストへ</a></li>
<li><a href="https://www.medi-08-data-06.work/entry/2018/12/18/232204">R の 確率密度関数 ( rnorm, pnorm, qnorm, dnorm ) とは何なのか</a></li>
<li><a href="https://www.medi-08-data-06.work/entry/kernel-estimate2">カーネル密度推定~グラフィカルにまとめてみる~</a></li>
<li><a href="https://www.medi-08-data-06.work/entry/distribution">脱統計初学者！確率分布まとめ~ベルヌーイ分布・二項分布・ポワソン分布・指数分布~</a></li>
<li><a href="https://www.medi-08-data-06.work/entry/normal_tdist">脱統計初学者！確率分布まとめ~正規分布・t分布とは~</a></li>
<li><a href="https://www.medi-08-data-06.work/entry/entral_limit_theorem">中心極限定理って結局何なのさ - 医療職からデータサイエンティストへ</a></li>
<li><a href="https://www.medi-08-data-06.work/entry/staticapower">有意水準と検出力をグラフィカルにシミュレーションで理解する</a></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgea2fe20" class="outline-2">
<h2 id="orgea2fe20"><span class="section-number-2">8</span> マニュアル的な</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org6a3df0a" class="outline-4">
<h4 id="org6a3df0a"><span class="section-number-4">8.0.1</span> <a href="https://cran.r-project.org/doc/contrib/manuals-jp/Mase-Rstatman.pdf">Mase-Rstatman.pdf</a>  基本パッケージ，カテゴリ別紹介，ヘルプドキュメント</h4>
</div>
<div id="outline-container-orgf1ea181" class="outline-4">
<h4 id="orgf1ea181"><span class="section-number-4">8.0.2</span> <a href="https://cran.r-project.org/manuals.html">CRAN: Manuals</a> R</h4>
<div class="outline-text-4" id="text-8-0-2">
<ul class="org-ul">
<li><a href="https://cran.r-project.org/doc/manuals/r-release/R-intro.pdf">R-intro.pdf</a></li>
<li><a href="https://cran.r-project.org/doc/manuals/r-release/R-lang.pdf">R-lang.pdf</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc7103b7" class="outline-4">
<h4 id="orgc7103b7"><span class="section-number-4">8.0.3</span> <a href="http://www.okadajp.org/RWiki/">RjpWiki - RjpWiki</a></h4>
</div>
</div>


<div id="outline-container-orgce4a2ad" class="outline-2">
<h2 id="orgce4a2ad"><span class="section-number-2">9</span> graphics</h2>
<div class="outline-text-2" id="text-9">
<p>
<a href="http://www.f.waseda.jp/sakas/R/Rgraphics17.html">R:グラフィックス</a> 早稲田のよくまとまった説明
</p>

<p>
<a href="https://data-science.gr.jp/implementation/ida_r_barplot.html">Rによる棒グラフの描画</a> <a href="https://data-science.gr.jp/implementation.html#ida">データ科学便覧 実装関連事項</a> データ科学便覧
</p>

<p>
<a href="https://www.kobiwa.jp/2017/02/18/post-240/">[R]グラフの一部を塗りつぶす</a> ** <a href="file:///nas/home/masayuki/COMM/Lects/R/RforStatistcs/RforS/org/graphics.html#MissingReference">正規分布グラフの区間を塗り潰す</a> (R)
</p>

<p>
<a href="https://www.rdocumentation.org/packages/graphics/versions/3.6.2/topics/persp">persp function | R Documentation</a>   3次元描画関数  
</p>
</div>
</div>

<div id="outline-container-orga1f5359" class="outline-2">
<h2 id="orga1f5359"><span class="section-number-2">10</span> search</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgffdd365" class="outline-3">
<h3 id="orgffdd365"><span class="section-number-3">10.1</span> 積率母関数</h3>
<div class="outline-text-3" id="text-10-1">
<p>
<a href="http://www.hino.meisei-u.ac.jp/ge/tsukada/lecture/prob/">meisei-u.ac.jpの確率論</a> 
</p>
<ul class="org-ul">
<li><a href="http://www.hino.meisei-u.ac.jp/ge/tsukada/lecture/prob/04-6.pdf">積率母関数</a></li>
</ul>
</div>
</div>


<div id="outline-container-org76152e1" class="outline-3">
<h3 id="org76152e1"><span class="section-number-3">10.2</span> 確率収束 例</h3>
<div class="outline-text-3" id="text-10-2">
<p>
<a href="https://kriver-1.hatenablog.com/entry/2018/05/14/204137">確率変数の収束についてまとめる - ブログ村</a>
</p>
</div>
</div>

<div id="outline-container-orgbaa76f3" class="outline-3">
<h3 id="orgbaa76f3"><span class="section-number-3">10.3</span> <span class="todo Doing">Doing</span> 標準偏差と標準誤差はどこが違うのか</h3>
<div class="outline-text-3" id="text-10-3">
<p>
標準偏差と標準誤差はどこが違うのか  
</p>
</div>
</div>

<div id="outline-container-org40d98ef" class="outline-3">
<h3 id="org40d98ef"><span class="section-number-3">10.4</span> 平均</h3>
<div class="outline-text-3" id="text-10-4">
<p>
<a href="https://ja.wikipedia.org/wiki/%E5%B9%B3%E5%9D%87#%E8%AA%BF%E5%92%8C%E5%B9%B3%E5%9D%87">平均 - Wikipedia</a>
調和平均 並列 <a href="https://www.omoshiro-suugaku.com/entry/tyouwa-heikinn">調和平均とは何か - いぬおさんのおもしろ数学実験室</a>
</p>
</div>
</div>

<div id="outline-container-org00f6eaf" class="outline-3">
<h3 id="org00f6eaf"><span class="section-number-3">10.5</span> <a href="https://bellcurve.jp/statistics/course/#step1">統計学の時間 | 統計WEB</a></h3>
<div class="outline-text-3" id="text-10-5">
<ul class="org-ul">
<li>独立性の検定 <a href="https://bellcurve.jp/statistics/course/9496.html">25-5. 独立性の検定 | 統計学の時間 | 統計WEB</a></li>
<li>母集団相関係数 検定 <a href="https://bellcurve.jp/statistics/course/9591.html">26-3. 相関係数 | 統計学の時間 | 統計WEB</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc8c8bc7" class="outline-3">
<h3 id="orgc8c8bc7"><span class="section-number-3">10.6</span> 信頼区間</h3>
<div class="outline-text-3" id="text-10-6">
<p>
<a href="https://ja.wolframalpha.com/examples/mathematics/statistics/">Wolfram|Alpha Examples: 統計</a>
</p>

<p>
<a href="https://bellcurve.jp/statistics/course/8891.html">19-3. 95％信頼区間のもつ意味 | 統計学の時間 | 統計WEB</a> (わかりやすい)
</p>

<p>
<a href="https://oku.edu.mie-u.ac.jp/~okumura/stat/what_is_CI.html">信頼区間って何？</a> () = 標本統計値 +ー 信頼水準点 * 標準誤差
</p>
</div>
</div>



<div id="outline-container-org847a68c" class="outline-3">
<h3 id="org847a68c"><span class="section-number-3">10.7</span> excel シートを別々のCSV</h3>
<div class="outline-text-3" id="text-10-7">
<p>
<a href="https://qiita.com/hisabo/items/abdd558e4dd0785eaf92">LibreOffice Calc でVBAマクロを使う（始め方） - Qiita</a>
</p>

<p>
<a href="https://moripro.net/vba-createfile/">【ExcelVBA】エクセルブックの全シートからCSV(テキスト)ファイルを一括出力する｜もりさんのプログラミング手帳</a>
</p>
</div>
</div>

<div id="outline-container-org3b82dc3" class="outline-3">
<h3 id="org3b82dc3"><span class="section-number-3">10.8</span> R 移動平均 荷重平均</h3>
<div class="outline-text-3" id="text-10-8">
<p>
lamda&lt;-2<sup>(-1/250)</sup>
wgt.exp&lt;-rep(0:nrow(x)-1)
wgt.exp&lt;-(1-lamda)*lamda<sup>wgt.exp</sup> 
</p>
</div>
</div>

<div id="outline-container-orgcb2f892" class="outline-3">
<h3 id="orgcb2f892"><span class="section-number-3">10.9</span> R と Excel 関数の対応</h3>
<div class="outline-text-3" id="text-10-9">
<p>
<a href="https://datumstudio.jp/blog/r%E3%81%A7excel%EF%BC%88xlsx%E3%83%95%E3%82%A1%E3%82%A4%E3%83%AB%EF%BC%89%E3%82%92%E8%AA%AD%E3%81%BF%E8%BE%BC%E3%82%80/">【Rで使える小技】RでExcel（xlsxファイル）を読み込む方法 | DATUM
STUDIO株式会社</a>
install.packages("openxlsx")
</p>
</div>
</div>

<div id="outline-container-org13feb4e" class="outline-3">
<h3 id="org13feb4e"><span class="section-number-3">10.10</span> R markdown</h3>
<div class="outline-text-3" id="text-10-10">
<p>
<a href="https://kazutan.github.io/kazutanR/Rmd_intro.html">R Markdown入門</a> <a href="https://qiita.com/tomotagwork/items/c92fb40a76f56ea16aa4">R Markdownによるレポート生成 - Qiita</a>
</p>
</div>
</div>

<div id="outline-container-org55ab49d" class="outline-3">
<h3 id="org55ab49d"><span class="section-number-3">10.11</span> R read.csv セパレータ</h3>
<div class="outline-text-3" id="text-10-11">
<p>
<a href="https://www.cyberer.net/2020/05/r-read-files.html">CYBERer.NET: R - 実践編 1 ファイルの読み込み、データフレームの加工</a>
</p>
</div>
</div>

<div id="outline-container-org5f99600" class="outline-3">
<h3 id="org5f99600"><span class="section-number-3">10.12</span> R ヒストグラム分析</h3>
</div>

<div id="outline-container-org8555a20" class="outline-3">
<h3 id="org8555a20"><span class="section-number-3">10.13</span> RStudio 使い方</h3>
<div class="outline-text-3" id="text-10-13">
<p>
Rstudio エクセルデータのコピペ
</p>

<p>
<a href="https://datasciencehenomiti.com/post-986/">コピペでRにデータ取り込み</a>
</p>
</div>

<div id="outline-container-org6a7414d" class="outline-4">
<h4 id="org6a7414d"><span class="section-number-4">10.13.1</span> <a href="https://kazutan.github.io/JSSP2018_spring/intro_rstudio.html">R/RStudio入門</a> CC-BY</h4>
<div class="outline-text-4" id="text-10-13-1">
<p>
これいいかも。データ処理の解説もあり。
</p>
</div>
</div>
</div>


<div id="outline-container-orgc9d4ea1" class="outline-3">
<h3 id="orgc9d4ea1"><span class="section-number-3">10.14</span> R グラフ 日本語</h3>
<div class="outline-text-3" id="text-10-14">
<p>
<a href="https://qiita.com/purple_jp/items/6626ec1ea4e34c7d45b1">MacOSのR/RStudioでplot関数で作図する際に、日本語の文字化けを治す方法 - Qiita</a>
</p>
<ul class="org-ul">
<li>.Rprofile で書く方法，これでmacでは成功</li>
</ul>

<p>
<a href="https://ill-identified.hatenablog.com/entry/2020/10/03/200618">おまえはもうRのグラフの日本語表示に悩まない (各OS対応) - ill-identified diary</a>
</p>
</div>
</div>

<div id="outline-container-org3389d55" class="outline-3">
<h3 id="org3389d55"><span class="section-number-3">10.15</span> R plot type</h3>
<div class="outline-text-3" id="text-10-15">
<ul class="org-ul">
<li><a href="https://www.kkaneko.jp/data/r/rplot.html">R システムの plot を用いた種々の散布図と折れ線グラフ</a></li>
<li><a href="https://data-science.gr.jp/implementation/ida_r_histogram.html">Rによるヒストグラムの描画</a></li>
</ul>
</div>

<div id="outline-container-org7f726c0" class="outline-4">
<h4 id="org7f726c0"><span class="section-number-4">10.15.1</span> R plot 重ね書き</h4>
<div class="outline-text-4" id="text-10-15-1">
<ul class="org-ul">
<li><a href="https://bioinfo-dojo.net/r-plot-overlay">R plot 重ねる方法３パターン サンプルでわかるRの使い方</a>
<ul class="org-ul">
<li>散布図の詳しい解説あり</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgca6f898" class="outline-3">
<h3 id="orgca6f898"><span class="section-number-3">10.16</span> R read.csv タブ 区切り</h3>
<div class="outline-text-3" id="text-10-16">
<p>
<a href="https://yokazaki.hatenablog.com/entry/2017/12/20/122605">Rでのtsv読み込み、pdf書き出し - yokaのblog</a>
</p>
</div>
</div>

<div id="outline-container-orgdfa4c72" class="outline-3">
<h3 id="orgdfa4c72"><span class="section-number-3">10.17</span> R data.frame 行列 変換</h3>
<div class="outline-text-3" id="text-10-17">
<p>
<a href="https://qiita.com/seinosuke/items/e8d762a08a331541de10">【R】データフレームをただの行列に変換したい - Qiita</a>
 matrix(as.matrix(df), nrow(df), ncol(df))
</p>

<p>
ma &lt;-unname(as.matrix(df))
</p>
</div>
</div>


<div id="outline-container-org9dfbcd0" class="outline-3">
<h3 id="org9dfbcd0"><span class="section-number-3">10.18</span> R 標準化 z</h3>
<div class="outline-text-3" id="text-10-18">
<p>
関数はなさそう
</p>
</div>
</div>

<div id="outline-container-orgf54a52c" class="outline-3">
<h3 id="orgf54a52c"><span class="section-number-3">10.19</span> R 尖度 歪度</h3>
<div class="outline-text-3" id="text-10-19">
<p>
<a href="https://toukeier.hatenablog.com/entry/%3Fp%3D1072">統計ソフトRでデータを集計値・指標で眺めてみるには？ - 統計ER</a>
</p>
<ul class="org-ul">
<li>install.packages("e1071")
library(e1071)
skewness(x) # 歪度
kurtosis(x) # 尖度</li>
</ul>
</div>
</div>


<div id="outline-container-org5d69ab7" class="outline-3">
<h3 id="org5d69ab7"><span class="section-number-3">10.20</span> R 最尤推定</h3>
<div class="outline-text-3" id="text-10-20">
<p>
<a href="https://rpubs.com/aishida/MLE">RPubs - MLEを実感する</a>
<a href="https://rpubs.com/aishida">RPubs</a> aishida
</p>
</div>

<div id="outline-container-org62a3a07" class="outline-4">
<h4 id="org62a3a07"><span class="section-number-4">10.20.1</span> R optim, optimize</h4>
<div class="outline-text-4" id="text-10-20-1">
<p>
<a href="https://stats.biopapyrus.jp/stats/optim.html">汎用最適化関数 optim | R の optim 関数で準ニュートン法や共役勾配法
などによるパラメーター推定</a>
</p>
<ul class="org-ul">
<li>正規分布のパラメーター推定</li>
</ul>
</div>
</div>

<div id="outline-container-org652c4bc" class="outline-4">
<h4 id="org652c4bc"><span class="section-number-4">10.20.2</span> R nlm</h4>
<div class="outline-text-4" id="text-10-20-2">
<p>
<a href="https://stats.biopapyrus.jp/stats/nlm.html">最適化関数 nlm | R の nlm 関数でニュートン法によるパラメーター推定</a>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Masayuki Suzuki</p>
<p class="date">Created: 2021-11-18 木 07:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
